
Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	СписокПрав.Очистить();
	
	НаборПрав = Метаданные.Роли;
	
	Для Каждого Роль Из НаборПрав Цикл
		
		СтрокаРОли = СписокПрав.Добавить();
		
		СтрокаРОли.ИмяРоли = Роль.Имя;
		СтрокаРОли.ПредставлениеРоли = РОль.Синоним;
		СтрокаРОли.Включено = Пользователь.Роли.Содержит(Роль);
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если Пользователь = Неопределено Тогда
	
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.ИМя = Наименование;
		Пользователь.ПолноеИмя = ПолноеИмя;
			
	КонецЕсли;
	
	Пользователь.Роли.Очистить();
	
	СписокРолей = СписокПрав.НайтиСтроки(Новый Структура("Включено", Истина));
	Для Каждого Роль Из СписокРолей Цикл
		Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль.ИмяРоли));
	КонецЦикла;
	
	Пользователь.Записать();	
	
КонецПроцедуры